--SQL_Workshop03
--1. 학생이름과 주소지를 표시하시오. 단, 출력 헤더는 "학생 이름", "주소지"로 하고, 
--정렬은 이름으로 오름차순 표시하도록 한다.

--2.  휴학중인 학생들의 이름과 주민번호를 나이가 적은 순서로 화면에 출력하시오.

--3. 주소지가 강원도나 경기도인 학생들 중 1900년대 학번을 가진 학생들의 이름과 학번, 
--주소를 이름의 오름차순으로 화면에 출력하시오. 단, 출력헤더에는 "학생이름", "학번", 
--"거주지 주소" 가 출력되도록 한다.

--4. 현재 법학과 교수 중 가장 나이가 많은 사람부터 이름을 확인할 수 있는 SQL 문장을 
--작성하시오. (법학과의 '학과코드'는 학과 테이블(TB_DEPARTMENT)을 조회해서 찾아 
--내도록 하자) 

--5. 2004년2학기에 'C3118100' 과목을 수강한 학생들의 학점을 조회하려고 한다. 학점이 
--높은 학생부터 표시하고, 학점이 같으면 학번이 낮은 학생부터 표시하는 구문을 
--작성해보시오.

--6. 학생 번호, 학생 이름, 학과 이름을 이름 가나다 순서로 정렬하여 출력하는 SQL 문을 
--작성하시오. 

--7. 춘 기술대학교의 과목 이름과 과목의 학과 이름을 학과 이름 가나다 순서로 출력하는 
--SQL 문장을 작성하시오. 

--8. 과목별 교수 이름을 찾으려고 한다. 과목 이름과 교수 이름을 출력하는 SQL 문을 
--작성하시오.

--9. 8번의 결과 중 ‘인문사회’ 계열에 속한 과목의 교수 이름을 찾으려고 한다. 이에 
--해당하는 과목 이름과 교수 이름을 출력하는 SQL 문을 작성하시오. 

--10. ‘음악학과’ 학생들의 평점을 구하려고 한다. 음악학과 학생들의 "학번", "학생 이름", 
--"젂전체 평점"을 평점이 높은 순서(평점이 동일하면 학번 순서)로 출력하는 SQL 문장을 
--작성하시오. (단, 평점은 소수점 1자리까지맊 반올림하여 표시핚다.)

--11. 학번이 A313047인 학생이 학교에 나오고 있지 않다. 지도 교수에게 내용을 전달하기 
--위한 학과 이름, 학생 이름과 지도 교수 이름이 필요하다. 이때 사용할 SQL 문을 
--작성하시오. 단, 출력헤더는 "학과이름", "학생이름", "지도교수이름"으로 
--출력되도록 한다.

--12. 2007 년도에 '인갂관계롞' 과목을 수강한 학생을 찾아 학생이름과 수강학기를 이름 
--가나다 순서로 표시하는 SQL 문장을 작성하시오.  

--13. 예체능 계열 과목 중 과목 담당교수를 한 명도 배정받지 못한 과목을 찾아 그 과목 
--이름과 학과 이름을 출력하는 SQL 문장을 작성하시오. 












